-- Лабораторна робота №1
-- студента групи КН-32
-- підгрупа 1
-- Бойчука Віталія
-- Варіант №4

-- Мета: Ознайомитись з основними типами мови. Ознайомитись зi структурою та
-- функцiями Glasgow Haskell Compiller. Набути навичок роботи з iнтерпретатором
-- ghci та визначення найпростiших функцiй.

-- Завдання 1. Наведiть приклади виразiв вказаного типу ((String,Integer), Char, [Double]). 
-- Кожен список має мiстити кiлька елементiв.

-- (("abc", 5), 'h', [0.5, 0.7, 0.3])
-- ((['a'..'q'], 2+3), '5', [2+3/4, 5-1/4])
-- (("ab" ++ "cd", 217), "abc" !! 0, [4.8,4.6..1.2]) 

-- Завдання 2. Визначте два варiанти вказаних далi функцiй, де аргументи будуть представленi
-- а) як один кортеж, б) без використання кортежiв чи спискiв. 
-- Функцiя приймає два рядки (String) i перевiряє, чи вони лексикографiчно впорядкованi.

-- a)
f1 :: (String, String) -> Bool 
f1 (s1, s2) = s2 >= s1

-- б)
f2 :: String -> String -> Bool 
f2 s1 s2 = s2 >= s1

-- Висновок: В результаті виконання лабораторної роботи, ми ознайомилися з основними типами мови Haskell,
-- набули навичок роботи з інтерпритатором ghci та навчились визначати найпростіші функції.