-- Лабораторна робота №2
-- студента групи КН-32
-- підгрупа 1
-- Бойчука Віталія
-- Варіант №4

-- Мета: Набути досвiду визначення рекурсивних функцiй, використання механiзму
-- зiставлення зi зразком i роботи з кортежами та списками.

-- Завдання: Визначте вказанi функцiї в кожному з завдань: а) без застосування, б) з
-- застосуванням вбудованих функцiй.
-- Завдання 1.4: Переписати список справа налiво.

-- Завдання 2.4: Перемiшування списку з n елементiв: пiсля першого розмiстити останнiй,
-- пiсля другого – передостаннiй тощо.

-- Тести:

-- *Main> listReverse1 "abcd1234"
-- "4321dcba"

-- *Main> listReverse2 "abcd1234"
-- "4321dcba"

-- *Main> listShuffle1 "abcd1234"
-- "a4b3c2d1"

-- *Main> listShuffle2 "abcd1234"
-- "a4b3c2d1"

-- Завдання 1.4 a:
listReverse1 :: [a] -> [a]
listReverse1 [] = []
listReverse1 [x] = [x]
listReverse1 (x:xs) = listReverse1 xs ++ [x]

-- Завдання 1.4 б:
listReverse2 :: [a] -> [a]
listReverse2 = reverse 

-- Завдання 2.4 a:
listShuffle1 :: [a] -> [a]
listShuffle1 [] = []
listShuffle1 [x] = [x]
listShuffle1 (x:xs) = [x] ++ listShuffle1(listReverse1 xs)

-- Завдання 2.4 б:
listShuffle2 :: [a] -> [a]
listShuffle2 [] = []
listShuffle2 [x] = [x] 
listShuffle2 (x:xs) = [x] ++ listShuffle2(reverse xs)            

-- Висновок: В результаті виконання лабораторної роботи, ми набули досвіду визначення рекурсивниї функцій,
-- навчилися використовувати механізм зіставлення зі зразком та попрацювали з кортежами та списками.